app/Controllers/frontEnd/Home.php

SELECT *
FROM `judul`
ORDER BY RAND()
 LIMIT 4
SELECT *
FROM `judul`
ORDER BY RAND()
 LIMIT 3
SELECT *
FROM `judul`
ORDER BY `judul` ASC
 LIMIT 3
SELECT *
FROM `judul`
ORDER BY `judul` DESC
 LIMIT 3
SELECT *
FROM `judul`
ORDER BY `judul` DESC
 LIMIT 9
SELECT *
FROM `judul`
ORDER BY `judul` DESC
 LIMIT 10
---
    public function index()
    {
        $data = [
            'title' => 'Satu-Media | News',
            'dropdown_category' => $this->article->getDropdownCategory()->getResultArray(),
            'top_news_slider' => $this->article->orderBy('judul', 'RANDOM')->findAll(4),
            'top_news_right' => $this->article->orderBy('judul', 'RANDOM')->findAll(4),

            // Menampilkan judul berdasarkan kategori (masih maintenance)
            // 'judul_grouped_by_category' => $this->article->getJudulGroupedByCategory()->getResultArray(),

            'featured_news' => $this->article->orderBy('judul', 'RANDOM')->findAll(3),
            'popular_news' => $this->article->orderBy('judul', 'ASC')->findAll(3),
            'latest_news' => $this->article->orderBy('judul', 'DESC')->findAll(3),
            'most_viewed' => $this->article->orderBy('judul', 'RANDOM')->findAll(3),
            'most_read' => $this->article->orderBy('judul', 'ASC')->findAll(3),
            'most_recent' => $this->article->orderBy('judul', 'DESC')->findAll(3),
            'main_news' => $this->article->orderBy('judul', 'DESC')->findAll(9),
            'main_news_list' => $this->article->orderBy('judul', 'DESC')->findAll(10)

SELECT *
FROM `judul`
ORDER BY RAND()
SELECT *
FROM `judul`
ORDER BY RAND()
 LIMIT 5
SELECT *
FROM `judul`
ORDER BY `judul` ASC
 LIMIT 5
SELECT *
FROM `judul`
ORDER BY `judul` DESC
 LIMIT 5
SELECT *
FROM `meta`
---
    public function readnews($slug)
    {
        $dataArticle = $this->article->getArticle($slug);

        // store record judul/article
        $this->article->record_judul($dataArticle['id_judul']);

        // store record kategori
        $this->kategori->record_kategori($dataArticle['id_kategori']);

        // store record meta/tag
        foreach ($dataArticle['meta'] as $m) {
            $this->meta->record_meta($m['id_meta']);
        }

        $data = [
            'title' => 'News detail | Satu-Media',
            'dropdown_category' => $this->article->getDropdownCategory()->getResultArray(),
            'breadcrumb' => 'News',
            'breadcrumb_active' => 'News detail',
            'article' => $dataArticle,
            'category_article_post' => $this->article->getCategoryArticlePost($slug)->getResultArray(),
            'record_judul' => $this->article->getCountViewArticle($slug)->getResultArray(),
            // 'konten' => $this->konten->getKonten()->getResultArray(),
            'related_news' => $this->article->orderBy('judul', 'RANDOM')->findAll(),
            'news_list_widget' => $this->article->orderBy('judul', 'RANDOM')->findAll(5),
            'featured_news_widget' => $this->article->orderBy('judul', 'RANDOM')->findAll(5),
            'popular_news_widget' => $this->article->orderBy('judul', 'ASC')->findAll(5),
            'latest_news_widget' => $this->article->orderBy('judul', 'DESC')->findAll(5),
            'category_widget' => $this->article->getCategoryWidget()->getResultArray(),
            'meta_widget' => $this->meta->findAll()

SELECT COUNT(*) AS `numrows` FROM `judul`
SELECT *
FROM `judul`
ORDER BY RAND()
SELECT *
FROM `judul`
ORDER BY RAND()
 LIMIT 5
SELECT *
FROM `judul`
ORDER BY `judul` ASC
 LIMIT 5
SELECT *
FROM `judul`
ORDER BY `judul` DESC
 LIMIT 5
SELECT *
FROM `meta`
---
    public function categories($nama_kategori)
    {
        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 5;
        $total   = $this->article->countAll();

        $data = [
            'title' => 'Satu-Media | News',
            'dropdown_category' => $this->article->getDropdownCategory()->getResultArray(),
            'category_selected' => $this->article->getCategorySelected($nama_kategori)->getResultArray(),
            'jumlah_judul_by_kat' => $this->article->getJumlahJudulByKat($nama_kategori)->getResultArray(),
            'judul_by_category_selected' => $this->article->getJudulByCategorySelected($nama_kategori, $page, $perPage)->getResultArray(),
            'pager' => $this->pager->makeLinks($page, $perPage, $total, 'pagination'),
            // 'judul_grouped_by_category' => $this->article->getJudulGroupedByCategory()->getResultArray(),
            'related_news' => $this->article->orderBy('judul', 'RANDOM')->findAll(),
            'news_list_widget' => $this->article->orderBy('judul', 'RANDOM')->findAll(5),
            'featured_news_widget' => $this->article->orderBy('judul', 'RANDOM')->findAll(5),
            'popular_news_widget' => $this->article->orderBy('judul', 'ASC')->findAll(5),
            'latest_news_widget' => $this->article->orderBy('judul', 'DESC')->findAll(5),
            'category_widget' => $this->article->getCategoryWidget()->getResultArray(),
            'meta_widget' => $this->meta->findAll()
        ];