app/Controllers/backEnd/Report/ActiveController.php

SELECT COUNT(*) AS `numrows`
FROM `judul` `j`
INNER JOIN `kategori` `k` ON `j`.`id_kategori` = `k`.`id_kategori`
WHERE `j`.`status` = 'P'
AND `k`.`status` = 1
SELECT `u`.`name`, `u`.`initial`, COUNT(j.judul) as articles, COUNT(rj.id_judul) as articles_view
FROM `users` `u`
LEFT JOIN `judul` `j` ON `j`.`user_id` = `u`.`id` AND `j`.`status` = "P"
LEFT JOIN `record_judul` `rj` ON `rj`.`id_judul` = `j`.`id_judul`
LEFT JOIN `kategori` `k` ON `j`.`id_kategori` = `k`.`id_kategori` AND `k`.`status` <> 0
GROUP BY `u`.`id`
ORDER BY `articles` DESC
---
    public function index()
    {
        // Get the total count of all articles
        $totalArticles = $this->db->table('judul j')
            ->select('*')
            ->join('kategori k', 'j.id_kategori = k.id_kategori', 'inner')
            ->where('j.status', 'P')
            ->where('k.status', true)
            ->countAllResults();

        // Modify the existing query to include percentage calculation
        $dataRaw = $this->db->table('users u')
            ->select('u.id, u.name, u.initial, COUNT(rj.id_judul) as articles_view')
            ->join('judul j', 'j.user_id = u.id AND j.status = "P"', 'left') // Use LEFT JOIN instead of INNER JOIN
            ->join('record_judul rj', 'rj.id_judul = j.id_judul', 'left')
            ->join('kategori k', 'j.id_kategori = k.id_kategori AND k.status <> 0', 'left')
            ->groupBy('u.id'); // Include non-aggregated columns in GROUP BY

        $data = $dataRaw->get()->getResult();