app/Controllers/backEnd/Report/RubrikController.php

    public function index()
    {
        $dataRaw = $this->db->table('kategori k')
            ->select('k.id_kategori, k.nama_kategori AS nama, COUNT(DISTINCT j.id_judul) AS articles')
            ->join('judul j', "k.id_kategori = j.id_kategori AND j.status = 'P'", 'left')
            ->groupBy('k.id_kategori, nama')
            ->orderBy('articles', 'DESC');

        $data = $dataRaw->get()->getResult();

        foreach ($data as $row) {
            $row->views = $this->db->table('record_kategori')
                ->select('COUNT(*) as count')
                ->where('id_kategori', $row->id_kategori)
                ->get()
                ->getFirstRow()
                ->count;
---
SELECT `k`.`id_kategori`, `k`.`nama_kategori` AS `nama`, COUNT(DISTINCT j.id_judul) AS articles
FROM `kategori` `k`
LEFT JOIN `judul` `j` ON `k`.`id_kategori` = `j`.`id_kategori` AND `j`.`status` = 'P'
GROUP BY `k`.`id_kategori`, `nama`
ORDER BY `articles` DESC
SELECT COUNT(*) as count
FROM `record_kategori`
WHERE `id_kategori` = '1'