app/Controllers/backEnd/Report/SearchController.php

    public function index()
    {
        $dataRaw = $this->db->table('searching s')
            ->select('s.keyword, COUNT(*) as times')
            ->groupBy('s.keyword')
            ->orderBy('times', 'DESC');

        $data = $dataRaw->get()->getResult();
---
SELECT `s`.`keyword`, COUNT(*) as times
FROM `searching` `s`
GROUP BY `s`.`keyword`
ORDER BY `times` DESC