app/Controllers/backEnd/Report/TagController.php

    public function index()
    {
        $dataRaw = $this->db->table('meta m')
        ->select('m.meta AS nama, COUNT(rcm.id_meta) AS views')
        ->join('record_meta rcm', 'rcm.id_meta = m.id_meta', 'left')
        ->groupBy('nama')
        ->orderBy('views', 'DESC');

        $data = $dataRaw->get()->getResult();
---
SELECT `m`.`meta` AS `nama`, COUNT(rcm.id_meta) AS views
FROM `meta` `m`
LEFT JOIN `record_meta` `rcm` ON `rcm`.`id_meta` = `m`.`id_meta`
GROUP BY `nama`
ORDER BY `views` DESC