app/Controllers/backEnd/Report/ViewController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `u`.`name` AS `penulis`, `u`.`initial`, `j`.`judul`, `j`.`waktu_status` AS `published_at`, `c`.`nama_kategori` AS `kategori`, COUNT(rj.id_judul) as view
FROM `judul` `j`
LEFT JOIN `users` `u` ON `j`.`user_hash` = `u`.`user_hash`
INNER JOIN `kategori` `c` ON `j`.`id_kategori` = `c`.`id_kategori`
LEFT JOIN `record_judul` `rj` ON `rj`.`id_judul` = `j`.`id_judul`
WHERE `j`.`status` = 'P'
AND `c`.`status` = 1
GROUP BY `j`.`id_judul`
) CI_count_all_results
---
    public function index()
    {
        $dataRaw = $this->db->table('judul j')
        ->select('u.name AS penulis, u.initial, j.judul, j.waktu_status AS published_at, c.nama_kategori AS kategori, COUNT(rj.id_judul) as view')
        ->join('users u', 'j.user_hash = u.user_hash', 'left')
        ->join('kategori c', 'j.id_kategori = c.id_kategori', 'inner')
        ->join('record_judul rj', 'rj.id_judul = j.id_judul', 'left') // Use left join for optional views
        ->where('j.status', 'P')
        ->where('c.status', true)
        ->groupBy('j.id_judul') // Group by the article ID to count views per article
        ->orderBy('view', 'DESC');


        $perPage = 10;
        $page = $this->request->getVar('page') ?? 1;
        $keyword = $this->request->getVar('keyword') ?? null;

        if ($keyword !== null) {
            $dataRaw->like('j.judul', $keyword);
            $search = $keyword;
        }

        // Clone the original query builder to retrieve the total number of records
        $totalDataRaw = clone $dataRaw;
        $totalRows = $totalDataRaw->countAllResults();