app/Models/Category.php

INSERT INTO `record_kategori` (`id_kategori`) VALUES ('1')
---
    public function record_kategori($id_kategori)
    {
        $this->db->table('record_kategori')
        ->insert(['id_kategori' => $id_kategori]);