app/Models/Meta.php

INSERT INTO `record_meta` (`id_meta`) VALUES ('1')
---
    public function record_meta($id_meta)
    {
        $this->db->table('record_meta')
        ->insert(['id_meta' => $id_meta]);