app/Models/Title.php

    public function getArticle($slug = null)
    {
        if ($slug !== null) {
            $data = $this->db->table('judul j')
            ->select('j.id_judul, j.meta_keyword, u.name AS penulis, u.initial AS inisial, j.judul, j.slug, j.konten_singkat, j.status, j.waktu_status AS published_at, j.picture AS gambar, c.id_kategori, c.nama_kategori AS kategori, j.created_at AS created_at')
            ->join('users u', 'j.user_hash = u.user_hash', 'inner')
            ->join('kategori c', 'j.id_kategori = c.id_kategori', 'left')
            ->where('j.slug', $slug)
            ->get()
            ->getFirstRow();
            if ($data == null) {
                return null;
            }

            $dataKonten = $this->db->table('konten')
            ->select('konten')
            ->where('id_judul', $data->id_judul)
            ->orderBy('sequence', 'ASC')
            ->get()
            ->getResult();
            $konten = "";
            foreach ($dataKonten as $k) {
                $konten .= $k->konten;
            }

            $dataMeta = $this->db->table('meta m')
            ->select('m.id_meta, m.meta, m.slug')
            ->join('relasi_meta rm', 'm.id_meta = rm.id_meta', 'inner')
            ->where('rm.id_judul', $data->id_judul)
            ->get()
            ->getResultArray();

            $dataRelated = $this->db->table('judul j')
            ->select('j.judul, j.slug, j.picture AS gambar')
            ->join('backlink b', 'j.id_judul = b.backlink', 'inner')
            ->where('b.id_judul', $data->id_judul)
            ->get()
            ->getResultArray();
---
SELECT `j`.`id_judul`, `j`.`meta_keyword`, `u`.`name` AS `penulis`, `u`.`initial` AS `inisial`, `j`.`judul`, `j`.`slug`, `j`.`konten_singkat`, `j`.`status`, `j`.`waktu_status` AS `published_at`, `j`.`picture` AS `gambar`, `c`.`id_kategori`, `c`.`nama_kategori` AS `kategori`, `j`.`created_at` AS `created_at`
FROM `judul` `j`
INNER JOIN `users` `u` ON `j`.`user_hash` = `u`.`user_hash`
LEFT JOIN `kategori` `c` ON `j`.`id_kategori` = `c`.`id_kategori`
WHERE `j`.`slug` = 'how-pit-viper-built-party-mountain-out-of-potty-humor-and-90s-nostalgia'
SELECT `konten`
FROM `konten`
WHERE `id_judul` = '4'
ORDER BY `sequence` ASC
SELECT `m`.`id_meta`, `m`.`meta`, `m`.`slug`
FROM `meta` `m`
INNER JOIN `relasi_meta` `rm` ON `m`.`id_meta` = `rm`.`id_meta`
WHERE `rm`.`id_judul` = '4'
SELECT `j`.`judul`, `j`.`slug`, `j`.`picture` AS `gambar`
FROM `judul` `j`
INNER JOIN `backlink` `b` ON `j`.`id_judul` = `b`.`backlink`
WHERE `b`.`id_judul` = '4'

    public function getDropdownCategory()
    {
        $builder = $this->db->table('kategori')
            ->distinct()->select('nama_kategori')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori', 'left');

        $query = $builder->get();
---
SELECT DISTINCT `nama_kategori`
FROM `kategori`
LEFT JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`

    public function getCategorySelected($nama_kategori)
    {
        $builder = $this->db->table('kategori')
            ->distinct()->select('nama_kategori')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori', 'left')
            ->where('nama_kategori', $nama_kategori);

        $query = $builder->get();
---
SELECT DISTINCT `nama_kategori`
FROM `kategori`
LEFT JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`
WHERE `nama_kategori` = 'business'

    public function getJumlahJudulByKat($nama_kategori)
    {
        $builder = $this->db->table('kategori')
            ->select('nama_kategori')
            ->selectCount('judul', 'jml_judul_by_kat')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori')
            ->where('nama_kategori', $nama_kategori);

        $query = $builder->get();
---
SELECT `nama_kategori`, COUNT(`judul`) AS `jml_judul_by_kat`
FROM `kategori`
JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`
WHERE `nama_kategori` = 'business'

    public function getJudulByCategorySelected($nama_kategori, $page, $perPage)
    {
        $builder = $this->db->table('kategori')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori')
            ->where('nama_kategori', $nama_kategori)
            ->limit($perPage, ($page - 1) * $perPage);

        $query = $builder->get();
---
SELECT *
FROM `kategori`
JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`
WHERE `nama_kategori` = 'business'
 LIMIT 5

    public function getCategoryWidget()
    {
        $builder = $this->db->table('kategori')
            ->select('nama_kategori')
            ->selectCount('nama_kategori', 'jumlah_nama_kategori')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori', 'left')
            ->orderBy('nama_kategori', 'DESC')
            ->groupBy('nama_kategori');

        $query = $builder->get();
---
SELECT `nama_kategori`, COUNT(`nama_kategori`) AS `jumlah_nama_kategori`
FROM `kategori`
LEFT JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`
GROUP BY `nama_kategori`
ORDER BY `nama_kategori` DESC

    public function record_judul($id_judul)
    {
        $this->db->table('record_judul')
        ->insert(['id_judul' => $id_judul]);
---
INSERT INTO `record_judul` (`id_judul`) VALUES ('4')

    public function getCountViewArticle($slug)
    {
        $builder = $this->db->table('judul')
            ->join('record_judul', 'record_judul.id = judul.id_judul')
            ->where('slug', $slug);

        $query = $builder->get();
---
SELECT *
FROM `judul`
JOIN `record_judul` ON `record_judul`.`id` = `judul`.`id_judul`
WHERE `slug` = 'how-pit-viper-built-party-mountain-out-of-potty-humor-and-90s-nostalgia'

    public function getCategoryArticlePost($slug)
    {
        $builder = $this->db->table('kategori')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori')
            ->where('judul.slug', $slug);

        $query = $builder->get();
---
SELECT *
FROM `kategori`
JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`
WHERE `judul`.`slug` = 'how-pit-viper-built-party-mountain-out-of-potty-humor-and-90s-nostalgia'