app/Models/Title.php

SELECT DISTINCT `nama_kategori`
FROM `kategori`
LEFT JOIN `judul` ON `judul`.`id_kategori` = `kategori`.`id_kategori`
---
    public function getDropdownCategory()
    {
        $builder = $this->db->table('kategori')
            ->distinct()->select('nama_kategori')
            ->join('judul', 'judul.id_kategori = kategori.id_kategori', 'left');

        $query = $builder->get();